Thoughts on the cost of compute:

Hosting
Aquisition of hardware
Transportation of hardware
Time to setup
Networking costs
Storage costs
Physical Space required
Power required
Control/Censorship of server action
Privacy
Data storage
Quantum Proof Encryption
Know your peers
software development
shells and layers of privacy and data.

** example common blobs
#+begin_src shell
grep blob /mnt/data1/nix/packs.txt |cut "-d " -f1 |sort | uniq -c |sort -n |tail -10
#+end_src

#+RESULTS:
|  4 | 9baaac1f51350572bd2a9066281a7076f8d07fea |
|  4 | a846409201549b551413cc761971e9a343de93d2 |
|  4 | be726b8541691d127c8312c3c975d8a1a3a53a28 |
|  4 | d645695673349e3947e8e5ae42332d0ac3164cd7 |
|  4 | ecb8613a7e4dbf9c1f7772db07f8d50dd7280537 |
|  4 | f288702d2fa16d3cdf0035b15a9fcbc552cd88e7 |
|  7 | 8b137891791fe96927ad78e64b0aad7bded08bdc |
|  7 | 94a9ed024d3859793618152ea559a168bbcbb5e2 |
| 10 | 261eeb9e9f8b2b4b0d119366dda99c6fd7d35c64 |
| 35 | e69de29bb2d1d6434b8b29ae775ad8c2e48c5391 |


